Revit 2024 API
IFCAnyHandle.SetAttribute Method (String, ISet<String>)
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetAttribute(
	string name,
	ISet<string> values
)
Visual Basic
Public Sub SetAttribute ( _
	name As String, _
	values As ISet(Of String) _
)
Visual C++
public:
void SetAttribute(
	String^ name,
	ISet<String^>^ values
)
Parameters
name
Type: System.String
values
Type: System.Collections.Generic.ISet<String>
See Also
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace